if __name__ == '__main__':
    import numpy as np
    #数组的计算
    #数组和数字之间的计算
    t1 = np.array(range(24))
    print(t1+2)   #整个集合都会加上2
    print(t1-3)   #整个集合都会加上2
    print(t1*2)
    print(t1/2)
    print(t1/0)   #NAN  not a number    INF  infinite(无穷大)
    #数组和数组之间的计算
    #两个数组的维度相同
    t2 = np.array([[1,10,36,28,8,6],[7,9,12,10,12,35]])
    t3 = np.array([[1,5,6,7,8,3],[1,3,4,5,6,7]])
    print('新的数组相加后为：','\n',(t2+t3))     #数组对应位置相加
    print('新的数组相减后为：','\n',(t2-t3))     #数组对应位置相减
    print('新的数组相乘后为：','\n',(t2*t3))     #数组对应位置相乘
    print('新的数组相除后为：','\n',(t2/t3))     #数组对应位置相除
    #两个数组维数不同(保持至少一个维度相等即可！)
    #两个数组维度不同，但是两者列数相同，所以直接用列进行运算
    t4 = np.array([[12,5,6,12,8,3],[9,3,4,4,6,9]])
    t5 = np.array([3,1,2,2,2,3])
    print('新数组相加为','\n',t4+t5)
    print('新数组相减为','\n',t4-t5)
    print('新数组相乘为','\n',t4*t5)
    print('新数组相除为','\n',t4/t5)
    #两个数组维度不同，但是两者行数相同，所以直接用行进行运算
    t6 = np.array([[12,5,6,12,8,3],[9,3,4,4,6,9]])
    t7 = np.array([[1],[2]])
    print('新数组相加为','\n',t6+t7)
    print('新数组相减为','\n',t6-t7)
    print('新数组相乘为','\n',t6*t7)
    print('新数组相除为','\n',t6/t7)
    #广播原则
    t8 = np.array(range(18)).reshape(3,3,2)
    t9 = np.array(range(6)).reshape(3,2)
    print('新数组为','\n',t8+t9)



